{
    "GENERICOS.COMPETENCIA.TECNICA" : "Technical Skills",
    "GENERICOS.PROYECTOS" : "Project",
    "GENERICOS.VERMAS" : "View More",
    "GENERICOS.INFORMACION" : "Information",
    "GENERICOS.BASICOS" : "Basics",
    "GENERICOS.LENGUAJES": "Languages",
    "GENERICOS.HERRAMIENTAS": "Tools",
    "GENERICOS.BD": "Data base",
    "GENERICOS.GEO": "Georeferences",
    "GENERICOS.METODOLOGIAS": "Methodologies",
    "GENERICOS.VERSIONALE": "Version manager",
    "GENERICOS.FULLSTACK": "FullStack Developer",
    "GENERICOS.FRONTEND": "FrontEnd Developer",
    "GENERICOS.BACKEND": "BackEnd Developer",
    
    "HEADER.INICIO" : "Home",
    "HEADER.ACERCADEMI" : "About me",
    "HEADER.PROYECTOS" : "Projects",
    "HEADER.CONOCIMIENTOS" : "Expertise",
    "HEADER.EXPERIENCIAS" : "Work Experience",
    "HEADER.EDUCACION" : "Education",

    "QUIENSOY.HOLA" : "Hi 👋, I'm",
    "QUIENSOY.DEVELOPER1" : "FullStack",
    "QUIENSOY.DEVELOPER2" : "Developer",
    "QUIENSOY.DESCRIPCION" : "With more than 3 years of experience developing web applications for different governmental entities, e-commerce, among others.",
    "QUIENSOY.PORTAFOLIO" : "Portfolio",

    "DESCRIPCION.ACERCADEMI" : "About me",
    "DESCRIPCION.TITULO" : "Dynamism and Productivity are what represent me",
    "DESCRIPCION.CUERPO" : "I have a Bachelor's Degree in Computer Systems Engineering, with specialization in Continuous Improvement, Process Management and Quality. Currently, I am pursuing a Master's Degree in Systems Engineering with a specialization in Information Systems Management.",

    "PROYECTOS.TITULO" : "Looking for something? 🤨",
    "PROYECTOS.SUBTITULO" : "Here are a few projects, but...🤫",
    "PROYECTOS.TITULO.MODAL" : "Information",

    "PROYECTOS.ENTIDAD.INDECI":"National Institute of Civil Defense",
    "PROYECTOS.CORTA.SINPAD" : "Government project for natural disaster management",
    "PROYECTOS.DESCRIPCION.SINPAD" : "I played a key role in the SINPAD 3.0 development team, using the agile SCRUM methodology. My role included process analysis using BPMN, leading the frontend development team and participating in the constant review of new coding to improve both the frontend and backend. In addition, I took responsibility for creating essential system development documentation, establishing the main structure of the frontend and developing modules for SINPAD 3.0, VISOR GRD and SISCOE. From source code maintenance to bug fixing, deployment for testing and production, all these tasks addressed both Front End and Back End, using technologies such as Angular, RxJs, Oracle, PostGres, Java, among others.",

    "PROYECTOS.CORTA.EVANOZ": "Web developer with experience in e-Commerce, APIs, optimization and SCRUM methodology.",
    "PROYECTOS.DESCRIPCION.EVANOZ" : "I have excelled in the development of web projects, specializing in e-Commerce and blogs. My experience includes the creation of APIs using Node, as well as the implementation of administrative panels and stores using Angular or React. I have carried out the configuration of droplets with Ubuntu and the deployment of projects on VPS servers to achieve efficient production. In addition, I have demonstrated skills in code optimization, web page layout and payment gateway integration using API's such as Culqi and PayPal. All my projects have been managed under the agile SCRUM methodology, ensuring a collaborative and efficient approach to development.",

    "PROYECTOS.CORTA.TUTATI" : "Development and optimization of functionalities in logistics system 'Tutati' under SCRUM methodology.",
    "PROYECTOS.DESCRIPCION.TUTATI" : "I actively participated in improving the logistics system 'Tutati', analyzing processes and automating functions. I focused on the development of new functionalities and modules for delivery, warehouse and distribution tracking. In addition, I was in charge of modifying and optimizing the code, as well as maintaining the database.",

    "PROYECTOS.CORTA.CUENTASCLARAS": "Create a highly efficient complete solution for accounting and back-office management.",
    "PROYECTOS.DESCRIPCION.CUENTASCLARAS": "I recently led an exciting full stack project focused on accounting and its intranet, employing technologies such as Angular, TypeScript, RxJS, Bootstrap, MySQL, Node.js and NestJS to deliver a complete solution. On the frontend, I used Angular with TypeScript to build a dynamic and attractive user interface, leveraging RxJS to handle asynchronous operations. The choice of Bootstrap ensured a consistent and responsive user experience. On the backend, I implemented microservices with Node.js and NestJS, allowing for a modular and scalable architecture. MySQL was the database of choice, ensuring the integrity of the accounting data. The implementation of microservices not only facilitated accounting, but also allowed the creation of an internal intranet for efficient business management. The result is a robust and easy-to-maintain solution, tailored to the specific needs of the accounting sector.",

    "PROYECTOS.CORTA.CRYPTO": "Create cryptocurrency voting interface: intuitive design, dynamic and secure experience.",
    "PROYECTOS.DESCRIPCION.CRYPTO" : "I led frontend development for an exciting cryptocurrency voting platform, using HTML, Tailwind, Angular and TypeScript. I designed an intuitive interface with HTML, leveraged the flexibility of Tailwind for efficient styling, and employed the power of Angular and TypeScript to create a dynamic and secure user experience. The combination of these technologies allowed for an efficient and attractive voting interface, tailored to the specific needs of the cryptocurrency world.",

    "PROYECTOS.CORTA.WAYLESS": "I built my portfolio with a dynamic design, highlighting skills and projects.",
    "PROYECTOS.DESCRIPCION.WAYLESS" : "I developed my portfolio using Angular, Tailwind CSS and TypeScript. Angular provided a modular architecture, Tailwind CSS allowed for a stylish and efficient design, while TypeScript ensured robust code. This project resulted in a portfolio with a dynamic and attractive user interface, backed by robust and efficient code. This comprehensive approach ensured a professional presentation of my skills and projects, providing an exceptional user experience and a solid foundation for future updates.",

    "CONOCIMIENTOS.TITULO" : "Expertise",
    "CONOCIMIENTOS.SUBTITULO" : "I have knowledge in other tools as well, such as",
    "CONOCIMIENTOS.DESCRIPCION" : "I am at your disposal for any questions or proposals! Let's talk soon!",

    "EXPERIENCIA.TITULO1" : "Work",
    "EXPERIENCIA.TITULO2" : "Experience",

    "EXPERIENCIA.ENTIDAD.INDECI" : "National Institute of Civil Defense",
    "EXPERIENCIA.PERIODO.INDECI": "August 2022 - Present",

    "EXPERIENCIA.BREVE.INDECI": "Development of the Ministry of Defense system: SINPAD v3 for management of natural disasters and national emergencies.",
    "EXPERIENCIA.TAREAS.INDECI": [
        "Process analysis using BPMN for optimization and development of features in SINPAD 3.0",
        "Responsible for continuous review of new coding in frontend and backend environments for SINPAD 3.0's new features",
        "Leading the front-end development team for optimal performance",
        "Creation of essential documentation regarding the development of the SINPAD 3.0 system",
        "Creation of the main structure for the frontend environment of the SINPAD 3.0 system",
        "Development of modules for the new SINPAD 3.0 system: VISOR GRD, SISCOE",
        "Maintenance of source codes for Front End and Back End of the new SINPAD 3.0 system: VISOR GRD, SISCOE",
        "Deployment of the new Front End and Back End for the SINPAD 3.0 system: VISOR GRD, SISCOE for testing."
     ],

     "EXPERIENCIA.PERIODO.POLYSOFT" : "October 2021 - January 2022",
     "EXPERIENCIA.BREVE.POLYSOFT" : "In my experience, I have worked on the development of web projects, focusing on creating sites for e-Commerce and blogs. Throughout this process, I have implemented and optimized various key functionalities to provide a comprehensive user experience.",
     "EXPERIENCIA.TAREAS.POLYSOFT" : [
        "Development of web projects for e-Commerce and blogs.",
        "Creation of APIs (Node) and administrative panels and stores (Angular or React).",
        "Implementation of payment gateways using APIs such as Culqi and PayPal.",
        "Code optimization.",
        "Configuration of droplets with Ubuntu.",
        "Deployment of projects to production on VPS servers.",
        "Web page layout.",
        "Projects developed using the agile SCRUM methodology."
    ],

     "EXPERIENCIA.ENTIDAD.PLATANITOS" : "Commercial Mont SAC 'Platanitos'",
     "EXPERIENCIA.PERIODO.PLATANITOS" : "October 2021 - January 2022",
     "EXPERIENCIA.BREVE.PLATANITOS" : "During the development of the Tutati system, our focus is on managing Human Resources (HR) and logistical processes. We've created a platform that optimizes personnel management and enhances logistical efficiency, providing a comprehensive solution for business needs.",
     "EXPERIENCIA.TAREAS.PLATANITOS" : [
        "Analysis of logistical processes for the creation of features and automation of the 'Tutati' system.",
        "Development of new features in the 'Tutati' logistics management system.",
        "Development of modules for delivery tracking.",
        "Development of modules for warehouse process tracking.",
        "Development of modules for distribution tracking.",
        "Code modification and optimization.",
        "Database maintenance.",
        "Project developed under the agile SCRUM methodology."
    ],

     "EXPERIENCIA.ENTIDAD.FC" : "FC Accountants & Associates",
     "EXPERIENCIA.PERIODO.FC" : "February 2021 - July 2022",
     "EXPERIENCIA.BREVE.FC" : "As the leader of the systems department, I excel in developing and maintaining websites (FyF Auditors and FC Accountants), creating attendance systems, intranets for both administrative and client use, and successfully implementing Google Drive and SUNAT APIs.",
     "EXPERIENCIA.TAREAS.FC" : [
        "Responsible and leader of the systems department.",
        "Development and maintenance of websites (FyF Auditors and FC Accountants).",
        "Creation of attendance system for staff.",
        "Development of intranet system for administrators and clients.",
        "Implementation of Google Drive and SUNAT API."
    ],

     "EXPERIENCIA.PERIODO.ALIGNET" : "February 2018 - July 2018",
     "EXPERIENCIA.BREVE.ALIGNET" : "Development of e-commerce websites, focused on creating efficient and secure platforms that enhance user experience with attractive designs and customized solutions. We use advanced technologies for optimal online performance.",
     "EXPERIENCIA.TAREAS.ALIGNET" : [
        "Deployment of projects to production environments",
        "Configuration of software for production deployment",
        "Server configuration",
        "Maintenance of source code for projects linked to web payment commerce solutions"
    ],

     "EXPERIENCIA.ENTIDAD.FOTOLATINO" : "Photo Latino Productions",
     "EXPERIENCIA.PERIODO.FOTOLATINO" : "June 2016 - April 2017",
     "EXPERIENCIA.BREVE.FOTOLATINO" : "Development of the Foto Latinos Producciones website, aiming for an visually appealing and functional platform that reflects its unique identity. We incorporate advanced technologies for optimal online performance and an intuitive user experience.",
     "EXPERIENCIA.TAREAS.FOTOLATINO" : [
        "Website maintenance.",
        "Installation, configuration, administration, and maintenance of computer equipment.",
        "Monitoring of information and photographic material backups.",
        "Data recovery.",
        "Installation, activation, and software updates."
     ],

     "ESTUDIOS.TITLE" : "What did I study? 🤨",
     "ESTUDIOS.SUBTITLE" : "I leave you a brief summary here",

     "ESTUDIOS.ENTIDAD.UPN" : "Private University of the North",

     "ESTUDIOS.MAESTRIA.TITULO" : "Master's in Systems Engineering",
     "ESTUDIOS.MAESTRIA.PERIODO" : "Present Time",
     "ESTUDIOS.MAESTRIA.SKILLS" : [
        "Process and Quality Management",
        "Specialization in Information Security Management Systems"
     ],

    

     "ESTUDIOS.DIPLOMADO.TITULO" : "Diploma in Processes and Continuous Improvement with a Mention in Business Digital Transformation",
     "ESTUDIOS.DIPLOMADO.PERIODO" : "Mar 2021 - Sep 2022",
     "ESTUDIOS.DIPLOMADO.SKILLS" : [
        "Process management and improvement",
        "Quality indicators",
        "ISO 9001 standard",
        "Continuous improvement and organizational agility",
        "Technologies for operations management"
     ],

     "ESTUDIOS.BACHILLER.TITULO" : "Bachelor's in Systems Engineering",
     "ESTUDIOS.BACHILLER.PERIODO" : "Mar 2016 - Jul 2021",
     "ESTUDIOS.BACHILLER.SKILLS" : [
        "Proficiency in C++ programming language",
        "Familiarity with RUP and SCRUM methodologies",
        "Understanding of UML",
        "Knowledge of MySQL and PL/SQL databases",
        "Experience with Linux and Windows Server operating systems"
     ]

}