{
    "GENERICOS.COMPETENCIA.TECNICA": "Competencias técnicas",
    "GENERICOS.PROYECTOS": "Proyecto",
    "GENERICOS.VERMAS": "Ver más",
    "GENERICOS.INFORMACION": "Información",
    "GENERICOS.BASICOS": "Básicos",
    "GENERICOS.LENGUAJES": "Lenguajes",
    "GENERICOS.HERRAMIENTAS": "Herramientas",
    "GENERICOS.BD": "Bases de datos",
    "GENERICOS.GEO": "Georreferencia",
    "GENERICOS.METODOLOGIAS": "Metodologías",
    "GENERICOS.VERSIONALE": "Gestor de versiones",
    "GENERICOS.FULLSTACK": "Desarrollador FullStack",
    "GENERICOS.FRONTEND": "Desarrollador FrontEnd",
    "GENERICOS.BACKEND": "Desarrollador Backend",

    "HEADER.INICIO": "Inicio",
    "HEADER.ACERCADEMI": "Sobre mí",
    "HEADER.PROYECTOS": "Proyectos",
    "HEADER.CONOCIMIENTOS": "Conocimientos",
    "HEADER.EXPERIENCIAS": "Experiencia",
    "HEADER.EDUCACION": "Educación",

    "QUIENSOY.HOLA": "Hola 👋, yo soy",
    "QUIENSOY.DEVELOPER1": "Desarrollador",
    "QUIENSOY.DEVELOPER2": "FullStack",
    "QUIENSOY.DESCRIPCION": "También me puedes llamar <strong>Wayless</strong> 😌 <br/> tengo más de 4 años desarrollando aplicativos webs para diferentes entidades gubernamentales, e-commerce, entre otros.",
    "QUIENSOY.PORTAFOLIO": "Portafolio",

    "DESCRIPCION.ACERCADEMI": "ACERCA DE MÍ",
    "DESCRIPCION.TITULO": "Dinamismo y Productividad, son lo que me representan",
    "DESCRIPCION.CUERPO": "Soy Bachiller en Ingeniería de Sistemas Computacionales, con especialización en Mejora Continúa, Gestión de Procesos y Calidad. Actualmente, me encuentro cursando la Maestría en Ingeniería de Sistemas con mención en Gerencia de Sistemas de la Información.",

    "PROYECTOS.TITULO": "¿Buscabas algo? 🤨",
    "PROYECTOS.SUBTITULO": "Aquí te dejo algunos proyectos, pero...🤫",
    "PROYECTOS.TITULO.MODAL": "Información",

    "PROYECTOS.ENTIDAD.INDECI": "Instituto Nacional de Defensa Civil",
    "PROYECTOS.CORTA.SINPAD": "Proyecto gubernamental para la gestión de desastres naturales",
    "PROYECTOS.DESCRIPCION.SINPAD": "Me desempeñé como elemento clave en el equipo de desarrollo del sistema SINPAD 3.0, empleando la metodología ágil SCRUM. Mi rol abarcó el análisis de procesos mediante BPMN, liderando el equipo de desarrollo frontend y participando en la revisión constante de nuevas codificaciones para mejorar tanto el frontend como el backend. Además, asumí la responsabilidad de crear documentación esencial sobre el desarrollo del sistema, establecer la estructura principal del frontend y desarrollar módulos para SINPAD 3.0, VISOR GRD y SISCOE. Desde el mantenimiento de códigos fuente hasta la corrección de fallas, despliegue para pruebas y producción, todas estas tareas abordaron tanto el Front End como el Back End, utilizando tecnologías como Angular, RxJs, Oracle, PostGres, Java, entre otras.",

    "PROYECTOS.CORTA.EVANOZ": "Desarrollador web con experiencia en e-Commerce, APIs, optimización y metodología SCRUM.",
    "PROYECTOS.DESCRIPCION.EVANOZ": "Me he destacado en el desarrollo integral de proyectos web, especializándome en e-Commerce y blogs. Mi experiencia abarca la creación de APIs utilizando Node, así como la implementación de paneles administrativos y tiendas mediante Angular o React. He llevado a cabo la configuración de droplets con Ubuntu y el despliegue de proyectos en servidores VPS para alcanzar una producción eficiente. Además, he demostrado habilidades en la optimización de código, la maquetación de páginas web y la integración de pasarelas de pago mediante API's como Culqi y PayPal. Todos mis proyectos se han gestionado bajo la metodología ágil SCRUM, asegurando un enfoque colaborativo y eficiente en el desarrollo.",

    "PROYECTOS.CORTA.TUTATI": "Desarrollo y optimización de funcionalidades en sistema logístico &quot;Tutati&quot; bajo metodología SCRUM.",
    "PROYECTOS.DESCRIPCION.TUTATI": "Participé activamente en mejorar el sistema logístico &quot;Tutati&quot;, analizando procesos y automatizando funciones. Enfoqué el desarrollo de nuevas funcionalidades y módulos para seguimiento de delivery, almacén y distribución. Además, me ocupé de modificar y optimizar el código, así como de mantener la base de datos. Implementé el proyecto con la metodología ágil SCRUM, utilizando tecnologías como PHP, AWS (CodeCommit), MySQL y JavaScript.",

    "PROYECTOS.CORTA.CUENTASCLARAS": "Cree una solución completa para contabilidad y gestión interna altamente eficiente.",
    "PROYECTOS.DESCRIPCION.CUENTASCLARAS": "Recientemente lideré un emocionante proyecto full stack centrado en contabilidad y su intranet, empleando tecnologías como Angular, TypeScript, RxJS, Bootstrap, MySQL, Node.js y NestJS para ofrecer una solución completa. En el frontend, utilicé Angular con TypeScript para construir una interfaz de usuario dinámica y atractiva, aprovechando RxJS para gestionar operaciones asíncronas. La elección de Bootstrap garantizó una experiencia de usuario consistente y responsive. En el backend, implementé microservicios con Node.js y NestJS, permitiendo una arquitectura modular y escalable. MySQL fue la base de datos elegida, asegurando la integridad de los datos contables. La implementación de microservicios no solo facilitó la contabilidad, sino que también permitió la creación de una intranet interna para una gestión eficiente del negocio. El resultado es una solución robusta y fácil de mantener, adaptada a las necesidades específicas del sector contable.",

    "PROYECTOS.CORTA.CRYPTO": "Cree interfaz votación criptomonedas: diseño intuitivo, experiencia dinámica y segura.",
    "PROYECTOS.DESCRIPCION.CRYPTO": "Dirigí el desarrollo frontend para una emocionante plataforma de votación de criptomonedas, utilizando HTML, Tailwind, Angular y TypeScript. Diseñé una interfaz intuitiva con HTML, aproveché la flexibilidad de Tailwind para estilizar de manera eficiente y empleé la potencia de Angular y TypeScript para crear una experiencia de usuario dinámica y segura. La combinación de estas tecnologías permitió una interfaz de votación eficiente y atractiva, adaptada a las necesidades específicas del mundo de las criptomonedas.",

    "PROYECTOS.TITULO.WAYLESS": "Portafolio Wayless",
    "PROYECTOS.CORTA.WAYLESS": "Construí mi portafolio con un diseño dinámico, destacando habilidades y proyectos.",
    "PROYECTOS.DESCRIPCION.WAYLESS": "Desarrollé mi portafolio utilizando Angular, Tailwind CSS y TypeScript. Angular proporcionó una arquitectura modular, Tailwind CSS permitió un diseño estilizado y eficiente, mientras que TypeScript garantizó un código robusto. Este proyecto resultó en un portafolio con una interfaz de usuario dinámica y atractiva, respaldada por un código sólido y eficiente. Este enfoque integral aseguró una presentación profesional de mis habilidades y proyectos, brindando una experiencia del usuario excepcional y una base sólida para futuras actualizaciones.",

    "CONOCIMIENTOS.TITULO": "Conocimientos",
    "CONOCIMIENTOS.SUBTITULO": "Cuento con conocimientos en otras herramientas también como",
    "CONOCIMIENTOS.DESCRIPCION": "¡Estoy a tu disposición para cualquier consulta o propuesta! ¡Hablemos pronto!",

    "EXPERIENCIA.TITULO1": "Experiencias",
    "EXPERIENCIA.TITULO2": "Laborales",

    "EXPERIENCIA.ENTIDAD.INDECI": "Instituto Nacional de Defensa Civil",
    "EXPERIENCIA.PERIODO.INDECI": "Ago 2022 - Ene 2024",
    "EXPERIENCIA.PUESTO.INDECI": "Desarrollador FullStack",
    "EXPERIENCIA.BREVE.INDECI": "Mi participación en el desarrollo del sistema SINPAD v3 del Ministerio de Defensa fue fundamental para gestionar desastres y emergencias nacionales, aportando experiencia para asegurar una respuesta ágil y efectiva, consolidando así un componente esencial en la seguridad nacional.",
    "EXPERIENCIA.TAREAS.INDECI": [
        "Co-lideré el equipo frontend del sistema SINPAD con el jefe de proyectos, utilizando los enfoques de la metodología SCRUM.",
        "Realicé análisis de los procesos involucrados en la gestión de desastres naturales y emergencias nacionales desde el nivel 1 a nivel 5 para su optimización y digitalización.",
        "Desarrollé las funcionalidades principales de gestión de desastres y emergencias nacionales en el nuevo sistema SINPAD 3.0 tanto en el lado del Front End, como del Back End",
        "Desarrollé la herramienta de gestión de puntos de referencia geoespacial entre el sistema SINPAD 3.0 y el VISOR GRD con PostGis, Oracle Spatial, GeoServer, ArcGIS, QGIS, Springboot, y Leaflet para el despliegue de recursos tanto humanos como materiales para los distintos ministerios involucrados en el proyecto.",
        "Automaticé la creación de documentación indispensable en el frontend con estándares de codificación y comentarios utilizando jsDoc y Compodoc.",
        "Mantuve, optimicé y refactoricé codificaciones creada en versiones anteriores del sistema SINPAD.",
        "Migré la versión del sistema base del SINPAD de Angular 13 a la versión 14 para la obtención de mejor compatibilidad con plugins indispensables en la creación del proyecto.",
        "Tecnologías abarcadas: Angular, RxJs, Angular Material, SASS, Oracle 19c, Oracle Spatial, PostGres, PostGIS, ArcGIS, QGIS, Java, Java SpringBoot 3, JWT, BootStrap. NPM, TypeScript, JavaScript, Git, GitLab, Swagger, BPMN, SCRUM."
    ],

    "EXPERIENCIA.PERIODO.POLYSOFT": "Oct 2021 - Ene 2022",
    "EXPERIENCIA.BREVE.POLYSOFT": "En mi experiencia, he trabajado en el desarrollo de proyectos web, centrándome en la creación de sitios destinados a e-Commerce y blogs. Durante este proceso, he implementado y optimizado diversas funcionalidades clave para proporcionar una experiencia integral al usuario.",
    "EXPERIENCIA.TAREAS.POLYSOFT": [
        "Desarrollé proyectos de e-commerce y blogs, tanto en la parte principal de la página como también en su CMS para la gestión personalizada para el cliente.",
        "Desarrollé funcionalidades de las tiendas tanto en backend con NodeJS y Express, como también en el frontend con Angular y/o React.",
        "Apliqué distintos UI Frameworks como BootStrap, Angular Material, Tailwind, Ant Design, ng-zorro para una buena presentación frontend y su respectivo diseño responsive.",
        "Implementé distintas pasarelas de pagos como PayPal y Culqi en las páginas web desarrolladas para e-commerce.",
        "Realicé mantenimiento y refactorización de código fuente creado, según la nueva necesidad del cliente.",
        "Desplegué proyectos a producción en servidores VPS.",
        "Desarrollé todos los proyectos bajo el marco ágil SCRUM.",
        "Utilizando: Angular, React, HTML, CSS, SASS, NodeJS, Express, MongoDB, JavaScript, TypeScript, GIT, JWT, NPM, Socket.io, SCRUM."
    ],

    "EXPERIENCIA.ENTIDAD.PLATANITOS": "Comercial Mont &quot;Platanitos&quot;",
    "EXPERIENCIA.PERIODO.PLATANITOS": "Oct 2021 - Ene 2022",
    "EXPERIENCIA.BREVE.PLATANITOS": "Durante el desarrollo del sistema Tutati, nos centramos en gestionar Recursos Humanos (RRHH) y procesos logísticos. Creamos una plataforma que optimiza la administración de personal y mejora la eficiencia logística, proporcionando una solución completa para las necesidades empresariales.",
    "EXPERIENCIA.TAREAS.PLATANITOS": [
        "Analicé los procesos logísticos involucrados en el área de almacenamiento, así como los procesos internos de recursos humanos para la creación de funcionalidades y automatización de los procesos dentro del sistema “Tutati” de la empresa.",
        "Desarrollé los módulos de procesos logísticos como Ingresos/Salidas de almacén, seguimiento de productos, inventarios de almacenes, reposición de productos, mermas, entre otros a nivel backend con PHP y CodeCommit de AWS.",
        "Desarrollé los módulos de procesos de recursos humanos del sistema Tutati, como la gestión de tareas, recompensas a trabajadores, remuneraciones, entre otros.",
        "Creé y modifiqué queries para las consultas necesarias en el sistema Tutati.",
        "Proyecto desarrollado bajo la metodología ágil SCRUM.",
        "Utilizando: PHP, AWS (CodeCommit), MySQL, JavaScript, HTML, CSS, GIT, GitHub, BPMN, SCRUM."
    ],

    "EXPERIENCIA.ENTIDAD.FC": "FC Contadores & Asociados",
    "EXPERIENCIA.PERIODO.FC": "Feb 2021 - Jul 2022",
    "EXPERIENCIA.BREVE.FC": "Lideré el desarrollo y mantenimiento de páginas web para FyF Auditores y FC Contadores, así como la creación de sistemas de asistencias e intranet. También implementé con éxito APIs de Google Drive y SUNAT, aplicando mi experiencia en cada fase del proyecto.",
    "EXPERIENCIA.TAREAS.FC": [
        "Lideré el equipo del área de sistemas de la empresa en sus principales proyectos internos de desarrollo web.",
        "Analicé los procesos internos de recursos humanos que tenía la empresa contable, para poder optimizar y crear funcionalidades en el sistema intranet para colaboradores.",
        "Desarrollé la página web de la empresa principal FC Contadores, como también la página web de una empresa secundaria FyF Auditores Contables.",
        "Desarrollé el sistema de intranet para los colaboradores con herramientas como la firma de ingreso y salida de los colaboradores, seguimiento de tareas, cumplimientos de objetivos, entre otros.",
        "Desarrollé el sistema de intranet para administrativos y clientes con funcionalidades de un autoanálisis de ingresos y egresos, administración de documentación contable, Recepción de documentación, entre otros.",
        "Implementé las APIs Google Drive para la gestión de documentación de clientes y de la empresa y la API de SUNAT para consultas de RUC, DNI, entre otra información indispensable.",
        "Administré la base de datos MySQL para el correcto funcionamiento y seguimientos de datos, creando querys para la lectura posterior de resultados de búsquedas, KPI de la empresa.",
        "Utilicé las herramientas: Wordpress, PHP, JavaScript, JQuery, HTML, CSS, AJAX, GIT.",
        "Plugins de Wordpress utilizados: Elementor, Slider Revolution, Yoast SEO, Google Tag Manager, MailChimp, etc."
    ],

    "EXPERIENCIA.PERIODO.ALIGNET": "Feb 2018 - Jul 2018",
    "EXPERIENCIA.BREVE.ALIGNET": "Desarrollé páginas web e-commerce con un enfoque eficiente y seguro, mejorando la experiencia del usuario mediante atractivos diseños y soluciones personalizadas. Ademas, implementé tecnologías avanzadas para garantizar un rendimiento óptimo en línea durante todo el proyecto.",
    "EXPERIENCIA.TAREAS.ALIGNET": [
        "Mantuve código fuente de proyectos vinculados a soluciones de comercio con pago web.",
        "Participé en el diseño y definición de productos de pagos seguros y productos de la empresa.",
        "Utilizando: Java, Java SpringBoot, Oracle.",
        "Proyecto desarrollado bajo la metodología ágil SCRUM."
    ],

    "EXPERIENCIA.ENTIDAD.FOTOLATINO": "Foto Latino Producciones",
    "EXPERIENCIA.PERIODO.FOTOLATINO": "Jun 2016 - Abr 2017",
    "EXPERIENCIA.BREVE.FOTOLATINO": "En mi participación en Foto Latinos Producciones construí el sitio web con el objetivo de proporcionar una plataforma visualmente atractiva y funcional que capturara su identidad distintiva. Integré tecnologías avanzadas para asegurar un rendimiento óptimo en línea y una experiencia de usuario intuitiva, trabajando de cerca con el equipo para lograrlo.",
    "EXPERIENCIA.TAREAS.FOTOLATINO": [
        "Mantuve la página web de la empresa fotográfica, así como también gestionaba el contenido mostrado en ella.",
        "Gestioné y ejecuté las instalaciones, configuraciones, administración y mantenimiento de equipos informáticos.",
        "Monitoreé los backups de información y material fotográfico de las distintas sucursales.",
        "Gestioné la instalación, activación y actualización de software indispensable para la empresa.",
        "Utilicé las herramientas: Wordpress, Elementor, Slider Revolution, PHP, CSS."
    ],

    "ESTUDIOS.TITLE": "¿Qué estudié? 🤨",
    "ESTUDIOS.SUBTITLE": "Aquí te dejo un pequeño resumen",

    "ESTUDIOS.ENTIDAD.UPN": "Universidad Privada del Norte",

    "ESTUDIOS.MAESTRIA.TITULO": "Maestría en Ingeniería de Sistemas",
    "ESTUDIOS.MAESTRIA.PERIODO": "Actualidad",
    "ESTUDIOS.MAESTRIA.SKILLS": [
        "Gestión de Procesos y Calidad",
        "Especialización en sistema de gestión de seguridad de la información"
    ],

    "ESTUDIOS.DIPLOMADO.TITULO": "Diplomado en Procesos y Mejora Continua con Mención en Transformación Digital Empresarial",
    "ESTUDIOS.DIPLOMADO.PERIODO": "Mar 2021 – Set 2022",
    "ESTUDIOS.DIPLOMADO.SKILLS": [
        "Gestión y mejora de procesos",
        "Indicadores de calidad",
        "Norma ISO 9001",
        "Mejora continua y agilidad organizacional",
        "Tecnologías para la gestión de operaciones"
    ],

    "ESTUDIOS.BACHILLER.TITULO": "Bachiller en Ingeniería de Sistemas",
    "ESTUDIOS.BACHILLER.PERIODO": "Mar 2016 - Jul 2021",
    "ESTUDIOS.BACHILLER.SKILLS": [
        "Conocimiento en lenguajes de programación C++",
        "Conocimiento en metodología RUP y SCRUM",
        "Conocimiento en UML",
        "Conocimiento en Base de datos MySQL, PL/SQL",
        "Uso de sistemas operativos Linux, Windows Server"
    ]
}
